[
    {
      "title": "Max Aarons",
      "personal_life": "Aarons is of Jamaican descent. He is the cousin of Huddersfield Town player Rolando Aarons.",
      "url": "https://en.wikipedia.org/wiki/Max_Aarons",
      "length": 14251,
      "sections": []
    },
    {
      "title": "Rolando Aarons",
      "personal_life": "Aarons was born in Kingston, Jamaica, and migrated to England at the age of five to join his mother, who was living in Bristol. He is the cousin of Norwich City player Max Aarons.",
      "url": "https://en.wikipedia.org/wiki/Rolando_Aarons",
      "length": 21055,
      "sections": []
    },
    {
      "title": "Godwin Abadaki",
      "personal_life": "His older brother, Osebi (born 1991), is also a footballer who started his career at Blackburn Rovers' academy before playing extensively in English non-league football in the north of England.  In 2017, both brothers played at the same time for the same club, Shaw Lane and in 2020 were both at Buxton at the same time.",
      "url": "https://en.wikipedia.org/wiki/Godwin_Abadaki",
      "length": 11894,
      "sections": []
    },
    {
      "title": "Nathan Abbey",
      "personal_life": "His brother, Zema, was also a professional footballer.",
      "url": "https://en.wikipedia.org/wiki/Nathan_Abbey",
      "length": 22363,
      "sections": []
    },
    {
      "title": "Greg Abbott (footballer)",
      "personal_life": "In April 2018 it was announced that Abbott was suffering from prostate cancer. In May 2018 Abbott underwent an operation and returned to work.",
      "url": "https://en.wikipedia.org/wiki/Greg_Abbott_(footballer)",
      "length": 25219,
      "sections": []
    },
    {
      "title": "Shirley Abbott (footballer)",
      "personal_life": "Abbott served in the Middlesex and London Regiments during the First World War and ended the war as a sergeant in the Royal Sussex Regiment. During the Second World War, Abbott worked as a dockworker in Portsmouth, where he died of cancer in 1947.",
      "url": "https://en.wikipedia.org/wiki/Shirley_Abbott_(footballer)",
      "length": 8842,
      "sections": []
    },
    {
      "title": "Almen Abdi",
      "personal_life": "On 24 April 2011, Abdi was targeted by burglars and his possessions were stolen. He is good friends with compatriot and ex-Udinese teammate Gökhan Inler.",
      "url": "https://en.wikipedia.org/wiki/Almen_Abdi",
      "length": 18509,
      "sections": []
    },
    {
      "title": "Nadjim Abdou",
      "personal_life": "Abdou is married to his long–term girlfriend and now wife, Lucie, and together, they have three children, Ilyas, Inaya and Sohan. At one point, Abdou missed a match against Leeds United on 18 November 2012, due to returning to France for the birth of his daughter, Inaya. The following month, Abdou missed a match against Barnsley on 22 December 2012 as it revealed that he was given a compassionate leave to be with three-year-old Ilyas, who has been diagnosed with leukaemia, and his family in France.In an interview with the Daily Mirror, Abdou revealed that he grew up supporting Marseille and mentioned that he has a sister. Abdou's brother was in Paris on 13 November 2015, a night when it was hit by a series of terror attacks. This led to Abdou's concerns of his brother's well–being, which he eventually picked up his call of his safety.",
      "url": "https://en.wikipedia.org/wiki/Nadjim_Abdou",
      "length": 111585,
      "sections": []
    },
    {
      "title": "Nabil Abidallah",
      "personal_life": "In May 2006 Abidallah was arrested for burglary, after breaking into his former house which he had to leave after failing to pay his rent.",
      "url": "https://en.wikipedia.org/wiki/Nabil_Abidallah",
      "length": 5035,
      "sections": []
    },
    {
      "title": "Tammy Abraham",
      "personal_life": "Abraham was born in Camberwell, Greater London, and was an Arsenal fan growing up. He has a younger brother, Timmy Abraham, who is also a footballer and plays for Walsall.In January 2017, Abraham was involved in a motor vehicle accident while on loan at Bristol City. At the time of the accident he was alleged to have been driving without a licence or insurance, and was summoned to court as a result. He later obtained his licence, passing the test in March of the same year.",
      "url": "https://en.wikipedia.org/wiki/Tammy_Abraham",
      "length": 60881,
      "sections": []
    },
    {
      "title": "Timmy Abraham",
      "personal_life": "Abraham was born in London to Nigerian parents. He is the brother of Roma and England national team striker Tammy Abraham.",
      "url": "https://en.wikipedia.org/wiki/Timmy_Abraham",
      "length": 9594,
      "sections": []
    },
    {
      "title": "Paul Abrahams",
      "personal_life": "After leaving professional football, Abrahams worked for a publishing company. As of May 2011, he was working for consultancy company Fundamental Media.",
      "url": "https://en.wikipedia.org/wiki/Paul_Abrahams",
      "length": 10121,
      "sections": []
    },
    {
      "title": "Kelvin Abrefa",
      "personal_life": "Abrefa was born in Italy to Ghanaian parents, and moved to England at a young age.",
      "url": "https://en.wikipedia.org/wiki/Kelvin_Abrefa",
      "length": 4924,
      "sections": []
    },
    {
      "title": "David Abruzzese",
      "personal_life": "Abruzzese has a son named Rhys who is also a footballer and was part of the academy at Cardiff City. His other son, Dewi, currently plays for Cambrian & Clydach Vale.\n\n\n== References ==",
      "url": "https://en.wikipedia.org/wiki/David_Abruzzese",
      "length": 3774,
      "sections": []
    },
    {
      "title": "Kenny Achampong",
      "personal_life": "Achampong was born in Kilburn, London, on 26 June 1966, of Ghanaian descent, and attended Tulse Hill School.",
      "url": "https://en.wikipedia.org/wiki/Kenny_Achampong",
      "length": 4982,
      "sections": []
    },
    {
      "title": "Patrick Ada",
      "personal_life": "Ada was arrested in March 2012, in the connection to an allegation of rape.On 12 December Ada was sentenced to five years in prison after being convicted of raping a woman in Southwark, London on 1 March 2012.",
      "url": "https://en.wikipedia.org/wiki/Patrick_Ada",
      "length": 7088,
      "sections": []
    },
    {
      "title": "Charlie Adam",
      "personal_life": "Adam is the son of former professional player Charlie Adam, a midfielder who played for various Scottish clubs in the 1980s and 1990s. His father died on 17 December 2012, aged 50; the cause of death was publicly revealed as suicide in 2015. Adam's mother, Eleanor, fell ill with cancer, and was a big factor in his move back to Scotland. She died in December 2020. Adam's brother, Grant, is a goalkeeper who is currently playing for fellow Dundee-based side Lochee United. He has four other siblings: brothers Gary, Connor and Grant, and sister Nicola.Adam grew up supporting Dundee. He attended Dundee's Braeview Academy, alongside fellow future footballers Garry Kenneth and Scott Robertson (the latter of which he would be reunited with at Dundee).Adam is married to Sophie Anderson, whom he met in September 2009 in her hometown of Poulton-le-Fylde during a night out with some of his Blackpool teammates. They have two sons, Jack and Louis, and a daughter, Anabella. He moved with his family to Glasgow after signing for Dundee, having lived in Poulton-le-Fylde since his days at Blackpool.Adam was arrested and charged with a drink-driving offence in December 2021.",
      "url": "https://en.wikipedia.org/wiki/Charlie_Adam",
      "length": 74489,
      "sections": []
    },
    {
      "title": "Charlie Adams (English footballer)",
      "personal_life": "Adams' father is a retired professional footballer and his brother is a semi-professional footballer.",
      "url": "https://en.wikipedia.org/wiki/Charlie_Adams_(English_footballer)",
      "length": 23342,
      "sections": []
    },
    {
      "title": "Micky Adams",
      "personal_life": "His mother was a cook and his father was a steelworker; he grew up with two sisters and one brother; his brother suffers from cerebral palsy.He has three daughters from his first marriage; the marriage broke down during his time at Fulham, due in part to the amount of time he was putting into his football career. He later married Claire, with whom he had son Mitchel, born 2001, and daughter Madison, born 2004. As of 2016, they have remained living in Market Harborough since his time as Leicester manager.Adams made an appearance on BBC Radio Leicester's version of Desert Island Discs in August 2004, and chose songs from Nat King Cole (Love Letters), Billy Joel (Scenes from an Italian Restaurant), The Style Council (Shout to the Top!), and INXS (Mystify). He released his autobiography, Micky Adams – My Life In Football in September 2017.",
      "url": "https://en.wikipedia.org/wiki/Micky_Adams",
      "length": 106695,
      "sections": []
    },
    {
      "title": "Rex Adams (footballer)",
      "personal_life": "Adams was married to Muriel. He had two children, Ken and Mark.",
      "url": "https://en.wikipedia.org/wiki/Rex_Adams_(footballer)",
      "length": 4327,
      "sections": []
    },
    {
      "title": "Tom Adamson",
      "personal_life": "While growing up, Adamson went to school with future Scottish internationals Hughie Gallacher and Alex James.",
      "url": "https://en.wikipedia.org/wiki/Tom_Adamson",
      "length": 7357,
      "sections": []
    },
    {
      "title": "Tosin Adarabioyo",
      "personal_life": "Adarabioyo was born in Manchester, England, to Nigerian parents and is the youngest of three brothers. His oldest brother, Gbolahan, serves as his representative while middle brother Fisayo Adarabioyo is also a footballer. All three brothers were part of Manchester City's youth ranks. After his family moved to Whalley Range when he was still an infant, Adarabioyo was schooled in Manchester and attended Chorlton High School before enrolling with St Bede's College, a college associated with Manchester City.In December 2018, during the early years of his playing career, Adarabioyo's name was mentioned by teammate Raheem Sterling after he alleged that sections of the media served to \"fuel racism\" with their portrayal of young black footballers. The comments emerged after Sterling was subjected to alleged racist abuse during City's 2–0 defeat at Chelsea. \nSterling wrote: \"you have two young players starting out their careers, both play for the same team, both have done the right thing. Which is buy a new house for their mothers who have put in a lot of time and love into helping them get where they are, but look how the newspapers get their message across for the young black player and then for the young white player.\"  The Daily Mail headlines had been \"Young Manchester City footballer, 20, on £25,000 a week splashes out on mansion on market for £2.25 million despite having never started a Premier League match\" and \"Manchester City starlet Phil Foden buys new £2m home for his mum.\" In response to his name being mentioned, Adarabioyo said on his Instagram account: \"When they try to abuse and bring us down but God has protected you from all angles. Another year of prosperity.\"",
      "url": "https://en.wikipedia.org/wiki/Tosin_Adarabioyo",
      "length": 61041,
      "sections": []
    },
    {
      "title": "Alex Addai",
      "personal_life": "Born in England, Addai is of Ghanaian descent.",
      "url": "https://en.wikipedia.org/wiki/Alex_Addai",
      "length": 16684,
      "sections": []
    },
    {
      "title": "Corey Addai",
      "personal_life": "Addai was born in England to a Ghanaian father and Jamaican mother.\n\n\n== References ==",
      "url": "https://en.wikipedia.org/wiki/Corey_Addai",
      "length": 12094,
      "sections": []
    },
    {
      "title": "Colin Addison",
      "personal_life": "Addison currently resides in the city of Hereford, and was a pundit on BBC Radio Wales until 2008.\nHe has operated as commentator and pundit on Spanish Football for Sky Sports, and as experienced FA Cup player and manager, as commentator and pundit for ESPN.\nAddison acts as commentator and football advisor across the UK and Europe.\nHe also consults for clubs and media entities in Spain, USA and Asia.",
      "url": "https://en.wikipedia.org/wiki/Colin_Addison",
      "length": 13662,
      "sections": []
    },
    {
      "title": "Miles Addison",
      "personal_life": "In May 2013, Addison was fined for £1,185 for driving under an influence and was banned from driving for 18 months.",
      "url": "https://en.wikipedia.org/wiki/Miles_Addison",
      "length": 53815,
      "sections": []
    },
    {
      "title": "Tobi Adebayo-Rowling",
      "personal_life": "His uncle is BBC radio presenter Dotun Adebayo, who is the brother of Tobi's father (a Nigerian barrister). Adebayo-Rowling attended Longhill High School in Rottingdean, just outside Brighton.",
      "url": "https://en.wikipedia.org/wiki/Tobi_Adebayo-Rowling",
      "length": 16935,
      "sections": []
    },
    {
      "title": "Elijah Adebayo",
      "personal_life": "Adebayo was born in England and is of Nigerian descent.",
      "url": "https://en.wikipedia.org/wiki/Elijah_Adebayo",
      "length": 9410,
      "sections": []
    },
    {
      "title": "Leslie Adekoya",
      "personal_life": "Born in Ireland to Nigerian parents, Adekoya moved to England at a young age. He is eligible to represent England, Nigeria and Ireland internationally.",
      "url": "https://en.wikipedia.org/wiki/Leslie_Adekoya",
      "length": 3360,
      "sections": []
    },
    {
      "title": "Sam Adekugbe",
      "personal_life": "Adekugbe was born in London to parents with Nigerian heritage and lived in England until 10, when his family moved to Calgary, Alberta in Western Canada. His younger brother Elijah is also a professional soccer player. He is a fan of Manchester City.Adekugbe received his Canadian permanent residency status on August 23, 2013, which qualifies him as a domestic player on Canadian clubs for MLS roster purposes. He became a Canadian citizen in 2016.",
      "url": "https://en.wikipedia.org/wiki/Sam_Adekugbe",
      "length": 20594,
      "sections": []
    },
    {
      "title": "Hakeeb Adelakun",
      "personal_life": "Adelakun is of Nigerian descent. His older brother Hakeem is a non-league player.",
      "url": "https://en.wikipedia.org/wiki/Hakeeb_Adelakun",
      "length": 13301,
      "sections": []
    },
    {
      "title": "Charles Ademeno",
      "personal_life": "Since 2017 Ademeno has been employed by Fulham as the clubs Inclusion Officer, working with their academy and youth teams. He now works for the Royal Borough of Chelsea and Kensington Council.",
      "url": "https://en.wikipedia.org/wiki/Charles_Ademeno",
      "length": 13270,
      "sections": []
    },
    {
      "title": "Nigel Adkins",
      "personal_life": "Adkins and his wife, Angie, have two children.",
      "url": "https://en.wikipedia.org/wiki/Nigel_Adkins",
      "length": 24768,
      "sections": []
    },
    {
      "title": "Leslie Adlam",
      "personal_life": "Born in Guildford, Adlam's father Robert worked as a railway guard. Before turning professional as a footballer, Adlam worked as a railway clerk. He married May Turner, a shop assistant, on 19 February 1924 in Glodwick, Lancashire.\n\n\n== References ==",
      "url": "https://en.wikipedia.org/wiki/Leslie_Adlam",
      "length": 6748,
      "sections": []
    },
    {
      "title": "Benik Afobe",
      "personal_life": "Afobe is of DR Congolese descent and has two daughters with his partner Lois. He had a daughter named Amora, who died in November 2019 at the young age of two. Amora died in hospital due to her unexpectedly having sepsis.He has another daughter, who is named Alba who at the time of her older sister's death was only one year old.",
      "url": "https://en.wikipedia.org/wiki/Benik_Afobe",
      "length": 53319,
      "sections": []
    },
    {
      "title": "Gabriel Agbonlahor",
      "personal_life": "Agbonlahor was born in Birmingham, West Midlands. His parents separated while he was still young and he lived with his father, without any contact with his mother, for around 20 years. In 2009, ahead of the striker's 23rd birthday, his mother made a public appeal to him via the city's Sunday Mercury newspaper in order to become part of his life once more. Agbonlahor later contacted his mother and the pair reconciled. Following retirement, he has worked as a pundit for both Sky Sports and Talksport and written columns for online magazines such as Football Insider.",
      "url": "https://en.wikipedia.org/wiki/Gabriel_Agbonlahor",
      "length": 55762,
      "sections": []
    },
    {
      "title": "Osazee Aghatise",
      "personal_life": "He moved to England at the age of 7 where he spent the rest of his childhood.",
      "url": "https://en.wikipedia.org/wiki/Osazee_Aghatise",
      "length": 2982,
      "sections": []
    },
    {
      "title": "Steve Agnew",
      "personal_life": "Agnew's nephew Jordan Rhodes is also a footballer.",
      "url": "https://en.wikipedia.org/wiki/Steve_Agnew",
      "length": 18820,
      "sections": []
    },
    {
      "title": "Junior Agogo",
      "personal_life": " Junior Agogo was born on 1 August 1979 in Accra, Ghana as one of 11 siblings. He attended the Ridge Church School in Accra, but before completing primary school, he moved with his family to the UK. He subsequently returned to Ghana for three years, attending St. Augustine's College, an all-boys boarding secondary school in Cape Coast.\nHe didn't play on the football team at St Augustine's College, but instead represented the school in dancing competitions. Agogo was the nephew of JJ Rawlings. It was not until his family moved to the UK that he discovered his love and talent for football while playing with his siblings and friends. Agogo's father, Mr Emmanuel Agogo, a businessman, encouraged him to study instead of play sports.During an interview in 2008, Agogo revealed that he planned to open his own restaurant after his football career. However, Agogo instead started his own fitness training business. On 29 January 2015, Agogo was hospitalised after suffering a stroke. He struggled with his speech after his stroke, and expressed anxiety at his language problems. Agogo died in London on 22 August 2019, aged 40. On 20 September 2019, Agogo's remains were cremated in London after a private funeral ceremony at St. Mark's Church.On 26 August 2019, four days after his death, Nottingham Forest fans paid tribute to the striker on the 23rd minute of their match against Derby County in the Carabao Cup. Agogo wore the number 23 jersey during their League One promotion campaign.Bristol Rovers players also wore jersey the number 9 with Agogo's name during their warm-up training in before their match against Oxford United on 24 August 2019 in honour of him. Prior to kick-off both sets of players stood around the centre circle and applauded for a minute while words ‘RIP Junior Agogo’ was displayed on the scoreboard whilst the fans also sang and chanted his name.",
      "url": "https://en.wikipedia.org/wiki/Junior_Agogo",
      "length": 31486,
      "sections": [
        "Early life and education",
        "Other hobbies",
        "Later life and death"
      ]
    },
    {
      "title": "Kemy Agustien",
      "personal_life": "Agustien revealed he almost died from a serious car accident after his car flipped twice following a loss of control. In April 2013, Agustien was banned from driving for 12 months and picked up 39 points.",
      "url": "https://en.wikipedia.org/wiki/Kemy_Agustien",
      "length": 39764,
      "sections": []
    },
    {
      "title": "Patrick Agyemang",
      "personal_life": "After retiring from playing football, Agyemang began working as a personal trainer.",
      "url": "https://en.wikipedia.org/wiki/Patrick_Agyemang",
      "length": 56703,
      "sections": []
    },
    {
      "title": "Kevin Aherne-Evans",
      "personal_life": "Following their marriage, he adopted his wife Katie's surname, becoming Aherne-Evans.",
      "url": "https://en.wikipedia.org/wiki/Kevin_Aherne-Evans",
      "length": 13065,
      "sections": []
    },
    {
      "title": "Shahed Ahmed",
      "personal_life": "In 2004, at the time of his move to Wycombe, Ahmed commented: \"You do not see too many Asian players in football because they need to make a breakthrough. Other sports, such as cricket and squash, are more popular with the Asian community and parents do not encourage their children to play and watch football.\"Ahmed is Muslim and fasts during Ramadan. He also changes his diet and adapts his training around his fasting.",
      "url": "https://en.wikipedia.org/wiki/Shahed_Ahmed",
      "length": 6144,
      "sections": []
    },
    {
      "title": "Anel Ahmedhodžić",
      "personal_life": "Ahmedhodžić married his long-time girlfriend Marijana Cecilija Mašić in July 2022.",
      "url": "https://en.wikipedia.org/wiki/Anel_Ahmedhod%C5%BEi%C4%87",
      "length": 16753,
      "sections": []
    },
    {
      "title": "Will Aimson",
      "personal_life": "Aimson's late grandfather was Paul Aimson and was pupil at Highcliffe Senior School. Aimson excelled in golf and had a category one handicap (5) but chose football.",
      "url": "https://en.wikipedia.org/wiki/Will_Aimson",
      "length": 14830,
      "sections": []
    },
    {
      "title": "Ola Aina",
      "personal_life": "Aina has a brother, Jordan, who is currently playing for Fulham Academy.",
      "url": "https://en.wikipedia.org/wiki/Ola_Aina",
      "length": 19233,
      "sections": []
    },
    {
      "title": "Roger Aindow",
      "personal_life": "Aindow was born in the town of Seaforth, Merseyside, and currently lives in Formby, where he worked in the motor trade.\n\n\n== References ==",
      "url": "https://en.wikipedia.org/wiki/Roger_Aindow",
      "length": 3442,
      "sections": []
    },
    {
      "title": "Jason Ainsley",
      "personal_life": "Ainsley is also a teacher and head of year at Mortimer Community College.",
      "url": "https://en.wikipedia.org/wiki/Jason_Ainsley",
      "length": 9239,
      "sections": []
    },
    {
      "title": "Gareth Ainsworth",
      "personal_life": "During his playing days Ainsworth picked up the nickname \"Wild Thing\" due to his appearance and his rock star ambitions; he was in a band called APA with Wimbledon teammates Chris Perry and Trond Andersen. He later joined a band called Dog Chewed the Handle, named after a Terrorvision song, after answering an advert in Loot. Prior to the audition, Ainsworth hid his footballing career from his bandmates until he had been accepted. The band were invited to support Bad Manners on tour but were forced to turn down the offer due to clashes with Ainsworth's footballing career. The band later split, with Ainsworth and another member forming a new band, Road to Eden. By November 2019, he was fronting The Cold Blooded Hearts.He is considered a cult hero at Preston, Wimbledon, QPR, Port Vale, Lincoln City, and Wycombe Wanderers.On 21 October 2010, he represented the English Football League at the unveiling of the Footballers' Battalions memorial on the site of the Battle of the Somme. He graduated from the University of Liverpool with a Diploma in Professional Studies in Football Management in December 2019.Ainsworth is married to Donna, who is from Venezuela. He has three children. He is a practising Catholic.",
      "url": "https://en.wikipedia.org/wiki/Gareth_Ainsworth",
      "length": 70516,
      "sections": []
    },
    {
      "title": "Sam Aiston",
      "personal_life": "After retiring from playing football Aiston became a primary school teacher, working initially at Bicton primary school near Shrewsbury.He got married in August 2012 to Hollie Adams at St Chad's Church, Shrewsbury. At the time he was teacher at Newdale Primary School in Telford, Shropshire.In December 2021 Aiston, along with his ex Shrewsbury Town teammates Dave Edwards and Gavin Cowan, launched the podcast, In The Stiffs. In November 2022, he was head teacher at Broseley C.ofE. Primary School, when he was named to take up his next appointment as first head teacher at Bowbrook Primary School, Shrewsbury, in 2023.",
      "url": "https://en.wikipedia.org/wiki/Sam_Aiston",
      "length": 13053,
      "sections": []
    },
    {
      "title": "Mark Aizlewood",
      "personal_life": " Aizlewood speaks Welsh, having taken up lessons during a long injury spell as a player. After becoming proficient with the language he entered the Welsh Learner of the Year competition at the National Eisteddfod of Wales in Llandeilo where he was named as the winner. He released his Welsh language autobiography in 2009, entitled Amddiffyn fy Hun (Defending Myself) in which he revealed his 27-year-long battle with alcoholism and gambling and contemplating suicide. All proceeds from the book were donated to former England player Tony Adams Sporting Chance charity. His alcohol problem began as an 18-year-old, during his time at Luton Town where he found himself with a large disposable income. Remarking on this period, Aizlewood has stated: \"I was making a very good living [...] sometimes I didn't drink for two or three weeks, but then I'd drink for three of four days in one go.\" At his worst, Aizlewood was able to drink a bottle of brandy and 20 pints of lager in one session and still stand. He also developed a gambling addiction and has admitted to losing up to £30,000 in a single day. In his book, Aizlewood confessed to once nearly attempting suicide during a trip to Rome in 2003 due to the severity of his addictions. He stated that on 14 February, he had stood on a motorway bridge in the Italian capital in the early hours of the morning and considered jumping 50 ft to the carriageway below, commenting \" I didn't have an ounce of fear as I stood on the small wall and looked down at the cars speeding along the road 50ft below me, because I only had one intention: to jump.\" Following his retirement from playing, Aizlewood worked as a pundit for BBC Wales, covering Welsh football, where he developed a reputation as an outspoken critic. He was particularly critical of Swansea City and their decision to sign several foreign players whilst playing in the lower leagues. Swansea forward Giovanni Savarese, along with other players, was branded unreliable by Aizlewood and, following Savarese being dismissed for a deliberate elbow on Wrexham defender Mark McGregor during the 2001 FAW Premier Cup final, Aizlewood was accused of racism after calling Savarese a \"coward\" and stating \"but that's foreigners for you\". His outspoken views of Swansea and their players made him a target for fans of the club and, in October 2002, Aizlewood was attacked by a group of Swansea fans, after commentating at a game against Rochdale at Vetch Field, who pushed him into a gate, causing him to suffer grazing to his eye. BBC Wales head of sport, Nigel Walker demanded that the club would assure Aizlewood's safety at future matches following the incident.",
      "url": "https://en.wikipedia.org/wiki/Mark_Aizlewood",
      "length": 31554,
      "sections": ["Addiction battle", "Punditry"]
    },
    {
      "title": "David Ajiboye",
      "personal_life": "Born in England, Ajiboye is of Nigerian and Jamaican descent.",
      "url": "https://en.wikipedia.org/wiki/David_Ajiboye",
      "length": 14468,
      "sections": []
    },
    {
      "title": "Nathan Aké",
      "personal_life": "Aké was born in The Hague, South Holland. His father, Moise Ake, is from the Ivory Coast, while his mother Ineke Telder, is Dutch. Aké is a teetotaller.",
      "url": "https://en.wikipedia.org/wiki/Nathan_Ak%C3%A9",
      "length": 32290,
      "sections": []
    },
    {
      "title": "Ade Akinbiyi",
      "personal_life": "Akinbiyi has worked as a sports academy consultant and largely in both Nigeria and Ghana.",
      "url": "https://en.wikipedia.org/wiki/Ade_Akinbiyi",
      "length": 31743,
      "sections": []
    },
    {
      "title": "John Akinde",
      "personal_life": "Akinde was born in Camberwell, South London and is of Nigerian descent. Akinde's brother Sam (born 1993) has also played at Ebbsfleet, Alfreton and Barnet. The brothers have played together at the latter two clubs.",
      "url": "https://en.wikipedia.org/wiki/John_Akinde",
      "length": 26847,
      "sections": []
    },
    {
      "title": "Sam Akinde",
      "personal_life": "Akinde was born in England and is of Nigerian descent. His brother John is also a professional footballer.\n\n\n== References ==",
      "url": "https://en.wikipedia.org/wiki/Sam_Akinde",
      "length": 9442,
      "sections": []
    },
    {
      "title": "Adebayo Akinfenwa",
      "personal_life": "Akinfenwa was born in Islington, North London and is of Nigerian descent. His father is a Muslim and his mother is a Christian, and while Akinfenwa observed Ramadan as a child, he is now a Christian. He is a close friend of Clarke Carlisle, his former teammate at Northampton Town. As a child, he supported Liverpool and his favourite player was John Barnes.Akinfenwa has been ranked as the strongest footballer in the world in various editions of the FIFA videogame series. In September 2014 he was invited to attend the launch party for FIFA 15 alongside various celebrities and Premier League players, including Rio Ferdinand, George Groves and Lethal Bizzle. Akinfenwa reportedly weighs around 100 kilograms (16 st; 220 lb) and can bench press 180 kg (28 st; 400 lb). He runs a clothing label called Beast Mode On which plays on his strong man reputation. His autobiography The Beast: My Story was published by Headline Publishing in 2017.",
      "url": "https://en.wikipedia.org/wiki/Adebayo_Akinfenwa",
      "length": 46010,
      "sections": []
    },
    {
      "title": "Simeon Akinola",
      "personal_life": "Akinola has a degree in systems engineering.",
      "url": "https://en.wikipedia.org/wiki/Simeon_Akinola",
      "length": 13160,
      "sections": []
    },
    {
      "title": "Tunji Akinola",
      "personal_life": "Akinola is of Nigerian descent.",
      "url": "https://en.wikipedia.org/wiki/Tunji_Akinola",
      "length": 6122,
      "sections": []
    },
    {
      "title": "Femi Akinwande",
      "personal_life": "Akinwande is of Nigerian descent.",
      "url": "https://en.wikipedia.org/wiki/Femi_Akinwande",
      "length": 39421,
      "sections": []
    },
    {
      "title": "Jean-Louis Akpa Akpro",
      "personal_life": "Akpa Akpro is of Ivorian descent and has two brothers who play football. Jean-Daniel who is an Ivory Coast international and Jean-Jacques.",
      "url": "https://en.wikipedia.org/wiki/Jean-Louis_Akpa_Akpro",
      "length": 26039,
      "sections": []
    },
    {
      "title": "Hope Akpan",
      "personal_life": "Akpan was charged with misconduct by the Football Association in November 2011, after homophobic comments were posted on his Twitter account. Despite insisting that someone else had posted the comments, he admitted the charge after no one came forward to claim responsibility, and he was fined £1,200 by the FA.Growing up, Akpan supported Liverpool despite progressing in the Everton youth set-up. At school, Akpan was described as \"a bright student\", achieving seven As at GCSE. He also described himself as \"a northern boy\".While at Reading, Akpan took part in the community work, leading him nominated PFA's Player in the Community award.",
      "url": "https://en.wikipedia.org/wiki/Hope_Akpan",
      "length": 49489,
      "sections": []
    },
    {
      "title": "James Alabi",
      "personal_life": "Born in England, Alabi is of Nigerian descent.",
      "url": "https://en.wikipedia.org/wiki/James_Alabi",
      "length": 20198,
      "sections": []
    },
    {
      "title": "Martin Albrechtsen",
      "personal_life": "Albrechtsen has two children, Justin and Cassandra. He had their names displayed on a specially designed pair of football boots, which he wore in a league match against Sheffield United in February 2008. The boots were a present from his girlfriend Camilla Malmberg. However, Albrechtsen and Camilla got separated in 2011. He later came in a relationship with a Danish model named Emilie Posborg, but got also separated in 2015.It was revealed in 2016, that Albrechtsen's son, Justin, suffered from an extremely rare disease named esophageal atresia.",
      "url": "https://en.wikipedia.org/wiki/Martin_Albrechtsen",
      "length": 16108,
      "sections": []
    },
    {
      "title": "Marc Albrighton",
      "personal_life": "Albrighton confirmed to the Birmingham Mail that his dreams came true in playing for Aston Villa, the team he has supported since he was a boy. He named former Villa players David Ginola, Benito Carbone and Robert Pires as some of his footballing role models, along with England legend David Beckham to whom he has been compared due to crossing ability and technique.Albrighton became a father for the first time on 19 February 2012 when his partner Chloe Fulford gave birth to a daughter in Sutton Coldfield. Fulford's mother, Sue Davey, was killed in the Tunisian terror attacks in June 2015.",
      "url": "https://en.wikipedia.org/wiki/Marc_Albrighton",
      "length": 29968,
      "sections": []
    },
    {
      "title": "Colin Alcide",
      "personal_life": "Alcide now lives in Huddersfield and had continued to play amateur football, notably for Bay Athletic.",
      "url": "https://en.wikipedia.org/wiki/Colin_Alcide",
      "length": 5462,
      "sections": []
    },
    {
      "title": "Craig Alcock",
      "personal_life": "Alcock is also a keen cricketer playing for Wincanton CC in the Somerset League. Alcock studied for his A-Levels at Sexey's School in Bruton, Somerset.",
      "url": "https://en.wikipedia.org/wiki/Craig_Alcock",
      "length": 18141,
      "sections": []
    },
    {
      "title": "Danny Alcock",
      "personal_life": "Alcock's younger brother Adam is also a goalkeeper in non-league football. Their father is Barry Alcock, the former Stafford Rangers goalkeeper in the 1980s.",
      "url": "https://en.wikipedia.org/wiki/Danny_Alcock",
      "length": 11667,
      "sections": []
    },
    {
      "title": "John Aldridge",
      "personal_life": "When 96 Liverpool away fans were crushed to death in the Hillsborough disaster of 15 April 1989, during an FA Cup tie held in Sheffield against Nottingham Forest, Aldridge, as a native Liverpudlian and boyhood supporter of the club, was deeply affected by the tragedy. He attended the funerals of many of the victims, gave support to the injured and the bereaved, and publicly contemplated giving up the game.",
      "url": "https://en.wikipedia.org/wiki/John_Aldridge",
      "length": 48734,
      "sections": []
    },
    {
      "title": "Aji Alese",
      "personal_life": "Born in Islington and raised in Romford, Alese is of Nigerian descent and eligible to play for Nigeria as well as England.",
      "url": "https://en.wikipedia.org/wiki/Aji_Alese",
      "length": 13242,
      "sections": []
    },
    {
      "title": "Cheye Alexander",
      "personal_life": "In 2016 Alexander set up his own brand, Christian Rose, combining his name with that of his younger sister 'Rose'.",
      "url": "https://en.wikipedia.org/wiki/Cheye_Alexander",
      "length": 20162,
      "sections": []
    },
    {
      "title": "George Alexander (footballer)",
      "personal_life": "Born into a family of Millwall fans, his father, Gary, was a professional footballer and played for the club for three years between 2007–2010.",
      "url": "https://en.wikipedia.org/wiki/George_Alexander_(footballer)",
      "length": 3225,
      "sections": []
    },
    {
      "title": "Niclas Alexandersson",
      "personal_life": "Alexandersson was born in Halmstad on 29 December 1971 to father Lennart Alexandersson, a former Halmstads BK player. He grew up in Falkenberg, where he started playing football in the local club Vessigebro BK. In 1978, his brother Daniel Alexandersson, who was also a professional football player, was born. In 1988, he moved to Halmstad to play for Halmstads BK. He attended Falkenbergsgymnasieskola 1987-1990.\nAlexandersson married his wife Frida. The couple had first child Tilda in 1999 and son named Noah in 2001. While playing football, Alexandersson's family has lived in numerous places including Sheffield, Liverpool, and London before returning to Gothenborg. His son Noah Alexandersson has gone on to play professional football for IFK Göteborg in Allsvenskan.",
      "url": "https://en.wikipedia.org/wiki/Niclas_Alexandersson",
      "length": 13431,
      "sections": []
    },
    {
      "title": "Jérémie Aliadière",
      "personal_life": "Aliadière is of Swiss and Algerian descent and bears a tattoo with the flag of Algeria. Aliadière said that Arsenal manager Arsène Wenger, during his six-year spell at the Gunners, was like a father to him. They remain in contact to the present day.",
      "url": "https://en.wikipedia.org/wiki/J%C3%A9r%C3%A9mie_Aliadi%C3%A8re",
      "length": 38656,
      "sections": []
    },
    {
      "title": "Ezgjan Alioski",
      "personal_life": "Alioski is Muslim. He can speak Albanian, English, French, German, Italian, Macedonian and Spanish. He has citizenships of North Macedonia and Switzerland.",
      "url": "https://en.wikipedia.org/wiki/Ezgjan_Alioski",
      "length": 31294,
      "sections": []
    },
    {
      "title": "Hasney Aljofree",
      "personal_life": "Aljofree's son, Sonny (born 2004) is also a footballer and is part of the Manchester United academy.",
      "url": "https://en.wikipedia.org/wiki/Hasney_Aljofree",
      "length": 15193,
      "sections": []
    },
    {
      "title": "Jack Allan (footballer, born 1886)",
      "personal_life": "Allan attended College of St Hild and St Bede, Durham between 1906 and 1908 and during that time, he worked as a physical education teacher at a school in Wallsend. He later taught physical education at the Higher Grade School in Stockton-on-Tees. Allan married in 1915 and had two children. He served as a private in the Royal Army Medical Corps during the First World War and served on the Western Front from May 1918 through the April 1919, after the war. While home on demobilisation leave in May 1919, Allan died of a combination of Spanish flu and pneumonia and he was buried in Church Bank Cemetery, Wallsend.",
      "url": "https://en.wikipedia.org/wiki/Jack_Allan_(footballer,_born_1886)",
      "length": 6531,
      "sections": []
    },
    {
      "title": "Scott Allan",
      "personal_life": "Shortly after joining Dundee United as a youth, Allan was diagnosed with Type 1 Diabetes. He requires daily insulin injections, but the condition has not unduly hindered his football career.Allan was charged with assault in November 2010 after an incident in Glasgow which left two men needing hospital treatment. Charges against him were dropped on the basis of insufficient evidence, although three other men involved in the incident were convicted.",
      "url": "https://en.wikipedia.org/wiki/Scott_Allan",
      "length": 44942,
      "sections": []
    },
    {
      "title": "Sam Allardyce",
      "personal_life": "He met his wife Lynne Ward while still a youth team player at Bolton Wanderers, and the pair married on 1 June 1974. They have a son, Craig (9 June 1975), and daughter, Rachael (21 April 1979). He was given an honorary doctorate by the University of Bolton in July 2010. In addition to his football career, Allardyce has also run a number of businesses, including a motor spares firm, a fast-food restaurant, a social club, a pub, a piano bar, and a pub restaurant. He published his autobiography, Big Sam, in October 2015.In January 2013, Allardyce received \"substantial\", but undisclosed, damages from former Blackburn Rovers manager Steve Kean. In 2011, Kean had been recorded in a bar in Hong Kong alleging that Allardyce had been sacked from his post at Blackburn Rovers because he was a \"crook\".In May 2019, Allardyce's grandson, also named Sam, signed for Oxford United having previously been a youth team player with Manchester United and Bury.",
      "url": "https://en.wikipedia.org/wiki/Sam_Allardyce",
      "length": 119227,
      "sections": []
    },
    {
      "title": "Reise Allassani",
      "personal_life": "Born in England, Allassani is of Ghanaian descent.",
      "url": "https://en.wikipedia.org/wiki/Reise_Allassani",
      "length": 10897,
      "sections": []
    },
    {
      "title": "Ivor Allchurch",
      "personal_life": "Following his return from national service, Allchurch became engaged to Esme Thomas who was 16 at the time, the couple keeping their engagement secret from their parents until she turned 18. The pair publicly revealed their engagement when she turned 18 and eventually married in 1953, settling in the Mumbles district of Swansea. The couple had two sons, John and David. Following Allchurch's transfer to Newcastle in 1958, the family relocated to Kenton, Newcastle upon Tyne.He was named BBC Wales Sports Personality of the Year in 1962 and, in 1966, he was awarded a Most Excellent Order of the British Empire (MBE) in recognition of his services to Welsh football. He is also a member of the Welsh Sports Hall of Fame and the English Football Hall of Fame having been inducted in 1995 and 2005 respectively. Allchurch and his wife moved to a bungalow in Bishopston, Swansea after his retirement from professional football and he worked as a storeman for a stationery company. He died on 10 July 1997 at his home  aged 67. His funeral was held at Swansea Crematorium and attracted over 500 people.To celebrate Allchurch's achievements for his local club, it was originally decided that money should be raised for a bust of him, which was raised by Swansea City supporters. However, the strong support eventually saw the plans changed to incorporate a statute outside their stadium. In 2005, a life-sized statue of Allchurch was unveiled outside Swansea's newly opened Liberty Stadium.",
      "url": "https://en.wikipedia.org/wiki/Ivor_Allchurch",
      "length": 41235,
      "sections": []
    },
    {
      "title": "Doug Allder",
      "personal_life": "As of 2002, Allder was working at Heathrow Airport.",
      "url": "https://en.wikipedia.org/wiki/Doug_Allder",
      "length": 12802,
      "sections": []
    },
    {
      "title": "Bob Allen (footballer, born 1916)",
      "personal_life": "As a youth, alongside appearing for England Schoolboys, Allen played tennis at Wimbledon and was a renowned London Schools sprinter, but opted to pursue a career in football.\nAfter his move to Bedford Town in 1951, Allen found himself in hospital a year later with the prospect of a further year of treatment ahead of him. Colchester arranged a benefit match with Bedford in September 1952 to help aid his family's immediate financial concerns, with a gate of 4,500 in attendance. He later recovered and became a welfare officer in the Redbridge education department.\nAlbert Robert Allen died in Epping on 7 February 1992 at the age of 75.",
      "url": "https://en.wikipedia.org/wiki/Bob_Allen_(footballer,_born_1916)",
      "length": 10765,
      "sections": []
    },
    {
      "title": "Bradley Allen",
      "personal_life": "Allen comes from a famous footballing family. He is the son of former Chelsea, Tottenham and QPR player and manager Les Allen. His brother is former England international Clive Allen and his nephew is former Barnet player Oliver Allen. His uncle, Dennis Allen played over 300 league games for Reading, and his cousin Martin Allen has managed a number of Football League clubs, alongside representing QPR and West Ham United. He is also related to Charlie Allen, Martin's son, who has played for Notts County and Gillingham. Bradley is also a cousin to Paul Allen, who made appearances for West Ham, Tottenham and Southampton amongst others.",
      "url": "https://en.wikipedia.org/wiki/Bradley_Allen",
      "length": 17271,
      "sections": []
    },
    {
      "title": "Charlie Allen (footballer, born 1992)",
      "personal_life": "He is the son of ex-Gillingham manager Martin Allen, and grandson to ex-Reading player Dennis Allen.",
      "url": "https://en.wikipedia.org/wiki/Charlie_Allen_(footballer,_born_1992)",
      "length": 8191,
      "sections": []
    },
    {
      "title": "Clive Allen",
      "personal_life": "His son Oliver is also a footballer. In 2019, Allen published his autobiography, Up Front: My Autobiography. Allen also works as a commentator on ESPN and BT Sport predominantly for coverage of Ligue 1, Bundesliga, FA Cup, and UEFA club competitions.",
      "url": "https://en.wikipedia.org/wiki/Clive_Allen",
      "length": 17905,
      "sections": []
    },
    {
      "title": "Jack Allen (footballer, born 1903)",
      "personal_life": "Allen's brother Ralph was also a footballer. His grandson Paul Darling is Chair of the Horserace Betting Levy Board and another grandson Ian Darling is a British circuit judge.",
      "url": "https://en.wikipedia.org/wiki/Jack_Allen_(footballer,_born_1903)",
      "length": 5692,
      "sections": []
    },
    {
      "title": "Jack Allen (footballer, born 1891)",
      "personal_life": "Allen served in Italy as a lieutenant in the British Armed Forces during the First World War. After retiring from football, he worked for the Royal London Mutual Insurance Society.",
      "url": "https://en.wikipedia.org/wiki/Jack_Allen_(footballer,_born_1891)",
      "length": 6765,
      "sections": []
    },
    {
      "title": "Jamie Allen (footballer, born May 1995)",
      "personal_life": "In July 2022, Allen became a contestant on the eighth series of ITV2's Love Island. At the time of filming, Allen was contracted to National League side Halifax. His club said that \"the matter will be reviewed on his return.\" He was dumped from the villa alongside fellow contestant Danica Taylor on day 51.\n\n\n== References ==",
      "url": "https://en.wikipedia.org/wiki/Jamie_Allen_(footballer,_born_May_1995)",
      "length": 8448,
      "sections": []
    },
    {
      "title": "Joe Allen",
      "personal_life": "Allen is married to Lacey, with whom he has a son. Inspired by her involvement in animal welfare, he adopts hens to save them when they can no longer lay eggs. Allen's brother Harry lost his hearing at age three due to meningitis, and Joe became ambassador for Action on Hearing Loss Cymru in March 2015. Harry also played football and became captain of the Welsh deaf futsal team.",
      "url": "https://en.wikipedia.org/wiki/Joe_Allen",
      "length": 48130,
      "sections": []
    },
    {
      "title": "Malcolm Allen (footballer)",
      "personal_life": "In August 2006, Allen was in court charged with assault. In April 2008, charged from his Watford home, he was given a suspended sentence and a ban for drink-driving after admitting drinking ten pints of beer.In the autumn of 2009 Y Lolfa published his autobiography in his native Welsh language.",
      "url": "https://en.wikipedia.org/wiki/Malcolm_Allen_(footballer)",
      "length": 7451,
      "sections": []
    },
    {
      "title": "Michael Allen (footballer)",
      "personal_life": "After retiring from football, Allen moved to Marton and worked for ICI Wilton.",
      "url": "https://en.wikipedia.org/wiki/Michael_Allen_(footballer)",
      "length": 7972,
      "sections": []
    },
    {
      "title": "Paul Allen (footballer)",
      "personal_life": "Allen comes from a family of footballers, his uncles are former Reading striker Dennis Allen and fellow Tottenham player Les Allen. His cousins are Martin Allen, Clive Allen and Bradley Allen.\nAfter retiring from playing football at the end of the 1997–98, which he spent in Division One with Millwall, he worked for the Professional Footballers' Association.",
      "url": "https://en.wikipedia.org/wiki/Paul_Allen_(footballer)",
      "length": 13291,
      "sections": []
    },
    {
      "title": "Philip Allen (footballer)",
      "personal_life": "Allen served in the Grenadier Guards.",
      "url": "https://en.wikipedia.org/wiki/Philip_Allen_(footballer)",
      "length": 3885,
      "sections": []
    },
    {
      "title": "Ralph Allen (footballer)",
      "personal_life": "Allen's brother Jack was also a footballer.\n\n\n== References ==",
      "url": "https://en.wikipedia.org/wiki/Ralph_Allen_(footballer)",
      "length": 5155,
      "sections": []
    },
    {
      "title": "Rory Allen",
      "personal_life": "In 2000, Allen was arrested and fined alongside Portsmouth goalkeeper Aaron Flahavan after he admitted to being abusive towards police officers following a drinking session.",
      "url": "https://en.wikipedia.org/wiki/Rory_Allen",
      "length": 8198,
      "sections": []
    },
    {
      "title": "Dele Alli",
      "personal_life": "Alli was born in Milton Keynes, Buckinghamshire, to a Yoruba Nigerian father Kehinde and English mother Denise. Kehinde moved to the United States a week after Alli's birth. Alli was initially brought up by his mother, who suffered from alcohol problems. At the age of nine, he moved to Nigeria with his father, where he spent two years in an international school before returning to Milton Keynes to live with his mother. Alli went to Stantonbury Campus and The Radcliffe School in Wolverton.At the age of 13, he moved into the family home of Alan and Sally Hickford, parents of another young footballer with MK Dons and whom he refers to as his \"adoptive parents\" although he was never legally adopted by them. In the summer of 2016, Alli elected to stop wearing his surname on his match shirts because he felt no connection with the Alli family name, instead opting for \"Dele\".Alli was a Liverpool fan growing up with Steven Gerrard his childhood idol, and saw Gerrard and Frank Lampard as good role models on how they act as professionals. He is also a fan of British hip hop music, which led rapper Cadet to release a single referencing the footballer, \"Advice\".On 13 May 2020, Alli was held at knifepoint during a burglary by two men who broke into his house in north London. He was punched and suffered minor facial injuries. The burglars stole jewellery including watches.",
      "url": "https://en.wikipedia.org/wiki/Dele_Alli",
      "length": 70414,
      "sections": []
    },
    {
      "title": "Ian Allinson",
      "personal_life": "Alongside his managerial duties, Allinson has worked in sales, and during Boreham Wood's FA Trophy run in 2006, he was working as a marketing representative for the competition's sponsors, Carlsberg. Allinson was acting as the club's director of football at the time.In February 2019, Allinson was inducted into the Colchester United Hall of Fame.",
      "url": "https://en.wikipedia.org/wiki/Ian_Allinson",
      "length": 16919,
      "sections": []
    },
    {
      "title": "Tim Allpress",
      "personal_life": "Outside of football, Allpress is a constable in the Metropolitan Police Service. He featured in a BBC documentary about the notorious Broadwater Farm riot in North London in 1985, focussing on the changes to the area 20 years on, which at the time of the documentary was Allpress' beat where he worked as a community officer alongside Winston Silcott.",
      "url": "https://en.wikipedia.org/wiki/Tim_Allpress",
      "length": 6651,
      "sections": []
    },
    {
      "title": "Danny Allsopp",
      "personal_life": "Allsopp was born in Melbourne, Victoria and is married with two sons.He now works for a packaging firm as an Account Manager.",
      "url": "https://en.wikipedia.org/wiki/Danny_Allsopp",
      "length": 23261,
      "sections": []
    },
    {
      "title": "Thomas Allsopp",
      "personal_life": "In May 1911, Allsopp took ownership of the Hero of Redan pub on Thorpe Road in Norwich. He served as a sergeant in the Queen's Royal Regiment (West Surrey) and the Labour Corps during the First World War. After returning home from the war, he fell victim to the 1918 flu pandemic and died in Norwich on 7 March 1919. He was buried with military honours in Earlham Road Cemetery in the city.\n\n\n== References ==",
      "url": "https://en.wikipedia.org/wiki/Thomas_Allsopp",
      "length": 8014,
      "sections": []
    },
    {
      "title": "Jack Almond",
      "personal_life": "Almond was the son of a wealthy Yorkshire brewer and was reported to have inherited between £6,000 and £12,000 when his father died in 1897 - a huge sum of money for the time.   After he finished playing it was reported that he was working in the Doncaster locomotive works in 1910 but there is little evidence of what happened to him after that. It was initially reported that he had died in Liverpool in 1912 but there were two reports in the Sheffield press of him attending a game in Leeds in 1931, stating that he was the assistant manager of the Griffin Hotel in the city and was set to move to run a hotel in Bangor.",
      "url": "https://en.wikipedia.org/wiki/Jack_Almond",
      "length": 6202,
      "sections": []
    },
    {
      "title": "Manuel Almunia",
      "personal_life": "Almunia, whose brother served in the United Nations Peacekeeping Operations in Kosovo, has an interest in the Second World War and regularly visited sites associated with the conflict before European games with Arsenal.",
      "url": "https://en.wikipedia.org/wiki/Manuel_Almunia",
      "length": 31311,
      "sections": []
    },
    {
      "title": "Ben Alnwick",
      "personal_life": "His younger brother Jak, a goalkeeper for St Mirren, was at the Prudhoe local youth clubs and the Sunderland youth academy but joined North East rivals Newcastle United as a first year scholar in 2008. Jak won Newcastle's \"Wor Jackie\" award (named after Jackie Milburn) for best under-18 player in 2011. The pair played against each other in a 1–1 draw between Port Vale and Peterborough United on 17 October 2015.Alnwick has been in an on-off relationship with his childhood sweetheart since 2007.",
      "url": "https://en.wikipedia.org/wiki/Ben_Alnwick",
      "length": 28509,
      "sections": []
    },
    {
      "title": "Jak Alnwick",
      "personal_life": "Alnwick was born in Hexham and is the younger brother of former Sunderland and England under-21 goalkeeper Ben Alnwick. The pair played against each other in a 1–1 draw between Port Vale and Peterborough United on 17 October 2015. Alnwick typically sports a large beard, though went clean shaven to raise money for the Movember Foundation in 2016.",
      "url": "https://en.wikipedia.org/wiki/Jak_Alnwick",
      "length": 39567,
      "sections": []
    },
    {
      "title": "John Aloisi",
      "personal_life": "Aloisi is of Italian descent through his grandparents, who are from Calabria. His older brother Ross, was also a professional footballer, and has served under him as an assistant coach.\nA devout Catholic, Aloisi is married to Angela and has daughters: Alisia, Katia and Amaya.Aloisi appeared on the cover of the Australian version of Pro Evolution Soccer 6.\nIn addition to his native English, Aloisi also speaks Italian and Spanish.In 2020, Aloisi successfully underwent surgery to fix a tear in his mitral valve.",
      "url": "https://en.wikipedia.org/wiki/John_Aloisi",
      "length": 37080,
      "sections": []
    },
    {
      "title": "Marcos Alonso (footballer, born 1990)",
      "personal_life": "Alonso's grandfather, Marcos Alonso Imaz (better known as Marquitos), played with Real Madrid's first team for eight years. His father, Marcos Alonso Peña, played several seasons in Spain's top flight, most notably for Atlético Madrid and Barcelona, and both represented Spain at senior level.On 3 May 2011, Alonso was the driver in an accident causing the death of a young woman in Madrid. He was the driver of a car that collided with a wall, killing one of the passengers, a 22-year-old woman, having been driving at 112.8 km/h (70.1 mph) in wet conditions in a 50 km/h (30 mph) zone, with a blood alcohol content of 0.93 mg/mL of blood. He faced 21 months in prison when sentenced in February 2016, but his punishment was changed to a €61,000 fine and a driving ban of three years and four months, which had already been spent.",
      "url": "https://en.wikipedia.org/wiki/Marcos_Alonso_(footballer,_born_1990)",
      "length": 31655,
      "sections": []
    }
  ]
  